app/Controllers/CommissionController.php

SELECT `commission`.*, `op1`.`libelle` as `operateur_depart`, `op2`.`libelle` as `operateur_arrivee`
FROM `commission`
JOIN `operateur` as `op1` ON `op1`.`id` = `commission`.`id_operateur_depart`
JOIN `operateur` as `op2` ON `op2`.`id` = `commission`.`id_operateur_arrivee`
---
    public function index()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/Authentification/login')->with('error', 'Veuillez vous connecter');
        }

        $commissionModel = new CommissionModel();
        $commissions = $commissionModel
            ->select('commission.*, op1.libelle as operateur_depart, op2.libelle as operateur_arrivee')
            ->join('operateur as op1', 'op1.id = commission.id_operateur_depart')
            ->join('operateur as op2', 'op2.id = commission.id_operateur_arrivee')
            ->findAll();

SELECT *
FROM `commission`
WHERE `commission`.`id` = '1'
SELECT *
FROM `operateur`
---
    public function edit($id)
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/Authentification/login')->with('error', 'Veuillez vous connecter');
        }

        $commissionModel = new CommissionModel();
        $commission = $commissionModel->find($id);

        if (!$commission) {
            return redirect()->to('/Commission')->with('error', 'Commission introuvable');
        }

        $operateurModel = new OperateurModel();
        $operateurs = $operateurModel->findAll();