app/Controllers/CompteController.php

SELECT `numero`.*, `client`.`nom`, `operateur`.`libelle`
FROM `numero`
JOIN `client` ON `client`.`id` = `numero`.`id_client`
JOIN `operateur` ON `operateur`.`id` = `numero`.`id_operateur`
WHERE `numero`.`numero` = '0321234567'
 LIMIT 1
---
    public function solde()
    {
        $numero = session()->get('numero');

        if (!$numero) {
            return redirect()->to('/Authentification/login')->with('error', 'Veuillez vous connecter');
        }

        $numeroModel = new NumeroModel();
        $userdata = $numeroModel
            ->select('numero.*, client.nom, operateur.libelle')
            ->join('client', 'client.id = numero.id_client')
            ->join('operateur', 'operateur.id = numero.id_operateur')
            ->where('numero.numero', $numero)
            ->first();

SELECT *
FROM `numero`
WHERE `numero` = '0321234567'
 LIMIT 1
SELECT `mouvement`.*, `operation`.`libelle` as `type_operation`, `source`.`numero` as `numero_source`, `dest`.`numero` as `numero_destination`
FROM `mouvement`
JOIN `operation` ON `operation`.`id` = `mouvement`.`id_operation`
LEFT JOIN `numero` as `source` ON `source`.`id` = `mouvement`.`id_numero_source`
LEFT JOIN `numero` as `dest` ON `dest`.`id` = `mouvement`.`id_numero_destination`
WHERE `mouvement`.`id_numero_source` = 1
OR `mouvement`.`id_numero_destination` = 1
ORDER BY `mouvement`.`date_transaction` DESC
---
    public function historique()
    {
        $numero = session()->get('numero');
        $userId = session()->get('user_id');

        if (!$numero) {
            return redirect()->to('/Authentification/login')->with('error', 'Veuillez vous connecter');
        }

        $mouvementModel = new MouvementModel();
        $historique = $mouvementModel
            ->select('
                mouvement.*,
                operation.libelle as type_operation,
                source.numero as numero_source,
                dest.numero as numero_destination
            ')
            ->join('operation', 'operation.id = mouvement.id_operation')
            ->join('numero as source', 'source.id = mouvement.id_numero_source', 'left')
            ->join('numero as dest', 'dest.id = mouvement.id_numero_destination', 'left')
            ->where('mouvement.id_numero_source', $userId)
            ->orWhere('mouvement.id_numero_destination', $userId)
            ->orderBy('mouvement.date_transaction', 'DESC')
            ->findAll();