app/Controllers/DashboardController.php

SELECT `numero`.*, `client`.`nom`, `operateur`.`libelle`
FROM `numero`
JOIN `client` ON `client`.`id` = `numero`.`id_client`
JOIN `operateur` ON `operateur`.`id` = `numero`.`id_operateur`
WHERE `numero`.`numero` = '0321234567'
 LIMIT 1
SELECT `mouvement`.*, `operation`.`libelle` as `type_operation`, `source`.`numero` as `numero_source`, `dest`.`numero` as `numero_destination`
FROM `mouvement`
JOIN `operation` ON `operation`.`id` = `mouvement`.`id_operation`
LEFT JOIN `numero` as `source` ON `source`.`id` = `mouvement`.`id_numero_source`
LEFT JOIN `numero` as `dest` ON `dest`.`id` = `mouvement`.`id_numero_destination`
WHERE `mouvement`.`id_numero_source` = 1
OR `mouvement`.`id_numero_destination` = 1
ORDER BY `mouvement`.`date_transaction` DESC
 LIMIT 5
---
    public function index()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/Authentification/login')->with('error', 'Veuillez vous connecter');
        }

        $numero = session()->get('numero');
        $userId = session()->get('user_id');

        $numeroModel = new NumeroModel();
        $mouvementModel = new MouvementModel();

        // Récupérer les infos du client
        $userdata = $numeroModel
            ->select('numero.*, client.nom, operateur.libelle')
            ->join('client', 'client.id = numero.id_client')
            ->join('operateur', 'operateur.id = numero.id_operateur')
            ->where('numero.numero', $numero)
            ->first();

        // Récupérer les dernières transactions (5 dernières)
        $dernieresTransactions = $mouvementModel
            ->select('
                mouvement.*,
                operation.libelle as type_operation,
                source.numero as numero_source,
                dest.numero as numero_destination
            ')
            ->join('operation', 'operation.id = mouvement.id_operation')
            ->join('numero as source', 'source.id = mouvement.id_numero_source', 'left')
            ->join('numero as dest', 'dest.id = mouvement.id_numero_destination', 'left')
            ->where('mouvement.id_numero_source', $userId)
            ->orWhere('mouvement.id_numero_destination', $userId)
            ->orderBy('mouvement.date_transaction', 'DESC')
            ->findAll(5);

SELECT COUNT(*) AS `numrows`
FROM `mouvement`
WHERE `id_numero_source` = 1
OR `id_numero_destination` = 1
SELECT SUM(`montant`) AS `montant`
FROM `mouvement`
WHERE `id_numero_destination` = 1
AND `id_operation` = 1
 LIMIT 1
SELECT SUM(`montant`) AS `montant`
FROM `mouvement`
WHERE `id_numero_source` = 1
AND `id_operation` = 2
 LIMIT 1
SELECT SUM(`montant`) AS `montant`
FROM `mouvement`
WHERE `id_numero_source` = 1
AND `id_operation` = 3
 LIMIT 1
---
    private function getStatistiques($userId)
    {
        $mouvementModel = new MouvementModel();

        // Nombre total de transactions
        $totalTransactions = $mouvementModel
            ->where('id_numero_source', $userId)
            ->orWhere('id_numero_destination', $userId)
            ->countAllResults();

        // Total des dépôts
        $totalDepots = $mouvementModel
            ->where('id_numero_destination', $userId)
            ->where('id_operation', 1)
            ->selectSum('montant')
            ->first();

        // Total des retraits
        $totalRetraits = $mouvementModel
            ->where('id_numero_source', $userId)
            ->where('id_operation', 2)
            ->selectSum('montant')
            ->first();

        // Total des transferts envoyés
        $totalTransfertsEnvoyes = $mouvementModel
            ->where('id_numero_source', $userId)
            ->where('id_operation', 3)
            ->selectSum('montant')
            ->first();