app/Controllers/PrefixeController.php

    public function index()
    {
        // On récupère les préfixes avec le nom de l'opérateur (Jointure basique CI4)
        $data['prefixes'] = $this->prefixeModel
            ->select('prefixe.*, operateur.libelle as operateur_libelle')
            ->join('operateur', 'operateur.id = prefixe.id_operateur')
            ->findAll();
---
SELECT `prefixe`.*, `operateur`.`libelle` as `operateur_libelle`
FROM `prefixe`
JOIN `operateur` ON `operateur`.`id` = `prefixe`.`id_operateur`