app/Controllers/TarifController.php

    public function index()
    {
        $data['tarifs'] = $this->tarifModel
            ->select('tarif.*, operateur.libelle as operateur_libelle, operation.libelle as operation_libelle')
            ->join('operateur', 'operateur.id = tarif.id_operateur')
            ->join('operation', 'operation.id = tarif.id_operation')
            ->orderBy('operateur.libelle', 'ASC')
            ->orderBy('operation.libelle', 'ASC')
            ->orderBy('montant_min', 'ASC') // On trie les tranches dans le bon ordre
            ->findAll();
---
SELECT `tarif`.*, `operateur`.`libelle` as `operateur_libelle`, `operation`.`libelle` as `operation_libelle`
FROM `tarif`
JOIN `operateur` ON `operateur`.`id` = `tarif`.`id_operateur`
JOIN `operation` ON `operation`.`id` = `tarif`.`id_operation`
ORDER BY `operateur`.`libelle` ASC, `operation`.`libelle` ASC, `montant_min` ASC

    public function new()
    {
        $data['operateurs'] = $this->operateurModel->findAll();
        $data['operations'] = $this->operationModel->findAll();
---
SELECT *
FROM `operateur`
SELECT *
FROM `operation`

    public function edit($id)
    {
        $data['tarif'] = $this->tarifModel->find($id);
        $data['operateurs'] = $this->operateurModel->findAll();
        $data['operations'] = $this->operationModel->findAll();
---
SELECT *
FROM `tarif`
WHERE `tarif`.`id` = '1'
SELECT *
FROM `operateur`
SELECT *
FROM `operation`