app/Models/MouvementModel.php

INSERT INTO `mouvement` (`id_operation`, `id_numero_source`, `id_numero_destination`, `montant`, `montant_frais`, `id_tarif`, `date_transaction`) VALUES (2, 1, NULL, '210', 50, 2, '2026-07-20 14:16:12')
---
    public function createRetrait($idNumeroSource, $montant, $frais, $idTarif = null)
    {
        $data = [
            'id_operation' => 2,
            'id_numero_source' => $idNumeroSource,
            'id_numero_destination' => null,
            'montant' => $montant,
            'montant_frais' => $frais,
            'id_tarif' => $idTarif
        ];
        return $this->insert($data);

INSERT INTO `mouvement` (`id_operation`, `id_numero_source`, `id_numero_destination`, `montant`, `montant_frais`, `id_tarif`, `date_transaction`) VALUES (3, 1, 12, '1200', 0, NULL, '2026-07-20 13:45:21')
---
    public function createTransfert($idNumeroSource, $idNumeroDestination, $montant, $frais, $idTarif = null)
    {
        $data = [
            'id_operation' => 3,
            'id_numero_source' => $idNumeroSource,
            'id_numero_destination' => $idNumeroDestination,
            'montant' => $montant,
            'montant_frais' => $frais,
            'id_tarif' => $idTarif
        ];
        return $this->insert($data);