app/Models/NumeroModel.php

SELECT *
FROM `numero`
WHERE `numero` = '0321234567'
 LIMIT 1
---
    public function findByNumero($numero)
    {
        return $this->where('numero', $numero)->first();

UPDATE `numero` SET `solde` = 112840
WHERE `numero` = '0321234567'
---
    public function updateSolde($numero, $nouveauSolde)
    {
        return $this->where('numero', $numero)->set('solde', $nouveauSolde)->update();