app/Models/TarifModel.php

SELECT *
FROM `tarif`
WHERE `id_operateur` = 1
AND `id_operation` = 3
ORDER BY `montant_min` ASC
---
    public function getTranchesByOperateurOperation(int $idOperateur, int $idOperation): array
    {
        return $this->where('id_operateur', $idOperateur)
            ->where('id_operation', $idOperation)
            ->orderBy('montant_min', 'ASC')
            ->findAll();

SELECT *
FROM `tarif`
WHERE `id_operateur` = 1
AND `id_operation` = 2
AND `montant_min` <= 210
AND `montant_max` >= 210
 LIMIT 1
---
    public function findTarifApplicable($idOperateur, $idOperation, $montant): ?array
    {

        if (!is_numeric($idOperateur) || !is_numeric($idOperation) || !is_numeric($montant)) {
            return null;
        }

        return $this->where('id_operateur', (int) $idOperateur)
            ->where('id_operation', (int) $idOperation)
            ->where('montant_min <=', (float) $montant)
            ->where('montant_max >=', (float) $montant)
            ->first();